{
    "profile": {
        "name": "Anuj Joshi",
        "title": "Full Stack Developer",
        "summary": "Passionate developer with 10+ years of experience building scalable web applications. Focused on creating beautiful, user-centric experiences.",
        "image": "/logos/profile.jpg",
        "contact": {
            "phone": "",
            "email": "joshi.anujo7@gmail.com",
            "location": "Germany, Hessen"
        },
        "socials": [
            {
                "platform": "Github",
                "url": "https://github.com/joshianuj"
            },
            {
                "platform": "Linkedin",
                "url": "https://www.linkedin.com/in/joshianujo7"
            },
            {
                "platform": "Email",
                "url": "mailto:joshi.anujo7@gmail.com"
            }
        ]
    },
    "experience": [
        {
            "company": "Deutsche Bank",
            "logo": "/logos/db.svg",
            "role": "Senior Software Engineer",
            "period": "2020 — Present",
            "description": [
                "Designed, developed, and maintained enterprise-scale frontend applications using React, TypeScript, and modern JavaScript standards.",
                "Led cloud modernization initiatives including Google Kubernetes Engine (GKE) infrastructure setup and OpenShift (OCP 4) migration.",
                "Defined and implemented CI/CD standards using GitHub Actions, enabling one-touch and scheduled deployments across microservices.",
                "Improved platform observability and reliability by integrating New Relic monitoring and performance analytics.",
                "Strengthened security posture by integrating Prisma vulnerability scanning into CI/CD pipelines, reducing platform risk and improving compliance.",
                "Collaborated closely with product, platform, and engineering teams, contributing to architectural decisions, code quality, and operational excellence."
            ],
            "skills": [
                "React",
                "TypeScript",
                "Frontend Architecture",
                "Kubernetes",
                "CI/CD",
                "Cloud Platforms",
                "Agile"
            ]
        },
        {
            "company": "Candylabs",
            "logo": "/logos/candylabs.svg",
            "role": "Software Engineer",
            "period": "2017 — 2020",
            "description": [
                "Designed and implemented CI/CD automation pipelines using CircleCI, Docker, Kubernetes, and Google Cloud Platform.",
                "Developed and maintained full-stack web applications using React, Redux, Django, and GraphQL.",
                "Built Slack bots and automation services using Firebase, Google Cloud Functions, and webhook integrations.",
                "Designed and deployed serverless solutions, managed centralized logging, and supported SEO optimization initiatives.",
                "Delivered data analytics and visualization solutions using BigQuery and Google Data Studio to support business insights."
            ],
            "skills": [
                "React",
                "GraphQL",
                "Django",
                "Kubernetes",
                "Docker",
                "Google Cloud",
                "CI/CD",
                "Data Analytics"
            ]
        },
        {
            "company": "Leapfrog Technology Inc.",
            "logo": "/logos/leapfrog.svg",
            "role": "Software Engineer",
            "period": "2015 — 2016",
            "description": [
                "Owned end-to-end development lifecycle including analysis, design, implementation, deployment, and maintenance of production systems.",
                "Wrote high-quality, modular, and reusable code following TDD principles and industry best practices.",
                "Actively participated in code reviews, architectural discussions, and internal knowledge-sharing initiatives.",
                "Evaluated and introduced new technologies to improve development efficiency and product quality."
            ],
            "skills": [
                "Software Design",
                "TDD",
                "Backend Development",
                "Code Review",
                "Best Practices"
            ]
        },
        {
            "company": "Leapfrog Technology Inc.",
            "logo": "/logos/leapfrog.svg",
            "role": "Associate Software Engineer",
            "period": "2014 — 2015",
            "description": [
                "Developed full-stack web applications using Ruby on Rails and modern frontend technologies.",
                "Designed and implemented RESTful APIs and deployment workflows.",
                "Deployed and maintained applications on Heroku, Engine Yard, and AWS EC2.",
                "Followed organizational coding standards, development processes, and delivery best practices."
            ],
            "skills": [
                "Ruby on Rails",
                "REST APIs",
                "AWS EC2",
                "Heroku",
                "Full-Stack Development"
            ]
        },
        {
            "company": "Leapfrog Technology Inc.",
            "logo": "/logos/leapfrog.svg",
            "role": "Trainee",
            "period": "2014",
            "description": [
                "Completed structured training in HTML5, CSS, and JavaScript under senior mentorship.",
                "Applied pixel-perfect implementation techniques and W3C web standards.",
                "Built JavaScript-based mini-projects including interactive UI components and simple games."
            ],
            "skills": [
                "HTML5",
                "CSS",
                "JavaScript",
                "Frontend Fundamentals"
            ]
        }
    ],
    "skills": {
        "frontend": [
            "React",
            "Next.js (App Router)",
            "TypeScript (Strict Mode)",
            "Modern JavaScript (ES2023+)",
            "Redux Toolkit",
            "React Query",
            "HTML5",
            "CSS3",
            "Accessibility (WCAG)",
            "Tailwind CSS"
        ],
        "backend": [
            "Node.js",
            "REST APIs",
            "OpenAPI",
            "GraphQL (Schema-first)",
            "PostgreSQL",
            "Python (Django)",
            "Ruby on Rails"
        ],
        "cloud_devops": [
            "AWS",
            "Google Cloud",
            "Serverless Architecture",
            "Docker",
            "Kubernetes",
            "GitHub Actions",
            "CircleCI"
        ],
        "architecture_quality": [
            "System Design",
            "Scalability",
            "Test-Driven Development (TDD)",
            "Unit Testing",
            "Integration Testing"
        ],
        "tools_collaboration": [
            "Git",
            "GitHub",
            "Agile Development",
            "Cross-functional Collaboration"
        ]
    },
    "projects": [
        {
            "title": "OnTarget Technology",
            "description": "A construction project management platform that visualizes tasks through 3D models using the Autodesk API, delivering an augmented reality–like experience. Enabled teams to manage construction workflows more effectively by integrating spatial visualization with task tracking.",
            "image": "placeholder",
            "tech": [
                "JavaScript",
                "Autodesk API",
                "3D Modeling",
                "Web Applications"
            ]
        },
        {
            "title": "Solarwisely",
            "description": "A full-stack web application that helps homeowners and small businesses determine optimal solar panel sizing based on roof structure and orientation. Implemented core algorithms, interactive UI, and scalable backend services to process and analyze data efficiently.",
            "image": "placeholder",
            "tech": [
                "React",
                "Node.js",
                "NoSQL",
                "Big Data"
            ]
        },
        {
            "title": "Vyaguta – ERP System",
            "description": "An open-source ERP system designed to manage internal organizational resources and operations. Built a scalable frontend using React and Redux architecture and integrated it with a Java EE backend to support complex enterprise workflows.",
            "image": "placeholder",
            "tech": [
                "React",
                "Redux",
                "Java EE",
                "Enterprise Systems"
            ]
        }
    ],
    "individualProjects": [
        {
            "title": "Real-time Multiplayer Game (Pew Pew)",
            "description": "Hackathon-winning real-time multiplayer game featuring low-latency player synchronization and fast-paced gameplay mechanics, developed under time constraints.",
            "tech": [
                "JavaScript",
                "WebSockets"
            ],
            "achievement": "Winner – React Riot Hackathon"
        },
        {
            "title": "Data Analytics of Irregular Sensor Data",
            "description": "Applied decision tree classifiers to frequency-domain sensor data, extracting features to classify and predict irregular datasets.",
            "tech": [
                "Python",
                "NumPy",
                "Pandas",
                "Scikit-learn"
            ]
        },
        {
            "title": "Convolution Neural Network Analysis",
            "description": "Built a real-time camera interface using PyQt and implemented a convolutional neural network to detect and count fingers using image data.",
            "tech": [
                "Python",
                "PyQt",
                "TensorFlow",
                "OpenCV"
            ]
        }
    ]
}